#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.invitations.random_id.bucket: Refreshing state... [id=9Gw7CQ]
module.s3website["davidbornitz.dev"].random_id.bucket: Refreshing state... [id=OkYQpA]
module.s3website["resume.davidbornitz.dev"].random_id.bucket: Refreshing state... [id=wemegA]
aws_route53_zone.davidbornitz: Refreshing state... [id=Z04601461HBLV7APEL0VR]
module.s3website["resume.davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E1QIDDPCEV6TGP]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2IARHGO3S8MHZ]
module.invitations.aws_s3_bucket.bucket: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.s3website["davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=EY0LKW0B60BRA]
module.invitations.aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2BP1AO2KL43L]
module.s3website["davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=davidbornitz.dev-3a4610a4]
module.invitations.aws_cloudfront_public_key.invitation: Refreshing state... [id=K7Y686Q2ZTZD3]
module.invitations.aws_cloudfront_key_group.invitation: Refreshing state... [id=c967c287-868f-44c0-8050-316ee5704219]
aws_acm_certificate.davidbornitz: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb]
aws_route53_record.cert_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_route53_record.cert_validation["davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
module.invitations.aws_s3_bucket_website_configuration.website: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.invitations.aws_s3_object.website["stadium.jpg"]: Refreshing state... [id=stadium.jpg]
module.invitations.aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.invitations.aws_cloudfront_distribution.invitation: Refreshing state... [id=E25BUW33MYGUXP]
module.invitations.aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3website["resume.davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3website["davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3website["resume.davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3website["davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3website["resume.davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=E38ATFTVJ2UTVF]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
module.s3website["davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=ES4XGAGOUF20D]
module.s3website["davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=davidbornitz.dev-3a4610a4]
aws_acm_certificate_validation.davidbornitz: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.invitations.data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.invitations.aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_invitation.davidbornitz.dev_A]
module.invitations.data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2069678242]
module.invitations.aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.s3website["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3website["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3website["resume.davidbornitz.dev"].aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_resume.davidbornitz.dev_A]
module.s3website["davidbornitz.dev"].aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_davidbornitz.dev_A]
module.s3website["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2909630262]
module.s3website["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=1892471705]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
module.s3website["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev-3a4610a4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.invitations.data.aws_iam_policy_document.invitation will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invitation" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.invitations.data.aws_iam_policy_document.invitation_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invitation_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-identity:*",
              + "cognito-sync:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.invitations.aws_cognito_identity_pool.invitation will be created
  + resource "aws_cognito_identity_pool" "invitation" {
      + allow_classic_flow               = false
      + allow_unauthenticated_identities = true
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "invitation"
      + tags_all                         = (known after apply)
    }

  # module.invitations.aws_cognito_identity_pool_roles_attachment.invitation will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "invitation" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = (known after apply)
    }

  # module.invitations.aws_dynamodb_table.invitation will be created
  + resource "aws_dynamodb_table" "invitation" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "invitation"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "Name"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = false
        }
    }

  # module.invitations.aws_iam_role.invitation will be created
  + resource "aws_iam_role" "invitation" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "invitation"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.invitations.aws_iam_role_policy.invitation will be created
  + resource "aws_iam_role_policy" "invitation" {
      + id          = (known after apply)
      + name        = "invitation_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*